using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace CefiBrowser
{
    public static class CefConstHelper
    {
        #region 公用静态值
        /// <summary>
        /// 决定右边第标签列表按钮的位置，值为0时不显示，值为26时和关闭安钮重叠
        /// </summary>
        public static int DEF_GLYPH_WIDTH = 38;
        /// <summary>
        /// 当前标签Button到Form左边的距离动态的值
        /// </summary>
        public static float DEF_START_POS=13;
        /// <summary>
        /// 第一个标签Button到Form左边的距离默认值
        /// </summary>
        public static float DEF_START0_POS = 13;
        /// <summary>
        /// TabButton下面的一条装饰线
        /// </summary>
        public static float UderLineCost = 2f;
        /// <summary>
        /// 收藏夹按钮的宽度
        /// </summary>
        public static int FavireBT_Width =140;
        /// <summary>
        /// 收藏夹按钮之间的距离
        /// </summary>
        public static int FavireBT_Distance = 6;
        /// <summary>
        /// 收藏夹按钮参数？用途暂时忘了Umm...
        /// </summary>
        public static int FavireBT_Width_Parm = 26;
        /// <summary>
        /// 关闭按钮离右边的距离，默认为10
        /// </summary>
        public static int CloseRect_toRight_Parm = 10;
        /// <summary>
        /// table离左边边界的距离
        /// </summary>
        public static int Def_TabtoLeft = 10; 

        /// <summary>
        /// 两个标签之前的缩进
        /// </summary>
        public static int TabButtons_DefOffset = 13; //两个标签之前的缩进

        /// <summary>
        /// 默认标签Button高度
        /// </summary>
        public static int Def_TabButton_Hight = 30; 
        /// <summary>
        /// 非最大化时标签上边离Form上边距的距离
        /// </summary>
        public static int DEF_Header_TopDis = 14;
        /// <summary>
        /// 新增按钮宽度
        /// </summary>
        public static int AddnewButton_Width = 27;
        /// <summary>
        ///  决定标签栏的高度，不是标签的高度
        /// </summary>
        public static int DEF_HEADER_HEIGHT = 30;
        /// <summary>
        /// 控制TabButton样式的参数，当这个值变小时会成长方形
        /// 梯形，当为13F的时则是上短下长的梯形
        /// 默认值为13f
        /// </summary>
        public static float buttonPar = 13f;
        /// <summary>
        /// ?还没查到原因
        /// 暂时用来控制梯形高度
        /// 默认高度为TabButton高度一样
        /// </summary>
        public static int buttonHeight = 30;

        /// <summary>
        /// TabButton默认宽度
        /// </summary>
        public static float Def_TabButton_White = 200;

        /// <summary>
        /// 当前TabButton默认宽度
        /// </summary>
        public static float Current_TabButton_White = 200;
        /// <summary>
        /// FmenuItem中Item的宽度
        /// </summary>
        public static int FmenuItem_TextRect_Width = 266;
        /// <summary>
        ///Tab图标宽
        /// </summary>
        public static int rectIconSizeW = 16;
        /// <summary>
        /// Tab图标高
        /// </summary>
        public static int rectIconSizeH = 16;
        /// <summary>
        /// Tab关闭按钮宽
        /// </summary>
        public static int closeRectW = 15;
        /// <summary>
        /// Tab关闭按钮高
        /// </summary>
        public static int closeRectH = 15;

        /// <summary>
        /// 收藏夹按钮Icon与Title之前的距离
        /// </summary>
        public static int FavBTIcon_Distace = 20;
        /// <summary>
        /// 收藏夹子菜单中单个Item的高度
        /// </summary>
        public static int FMenuItem_Height = 22;
        /// <summary>
        /// 收藏栏标签字体高度
        /// </summary>
        public static int TextSizeH = 13;
        /// <summary>
        /// 设置新增按钮到窗体右边的距离
        /// </summary>
        public static int AddNbt_FormRight = 128; 
        /// <summary>
        /// 下载TabItem的Title， "下载内容"
        /// </summary>
        public static readonly string CefDownloadTitle = "下载内容";
        /// <summary>
        /// 内部浏览器下载页面地址 "CefiBrowser://Downloads"
        /// </summary>
        public static readonly string CefiBrowserInternalDownloadUrl = "CefiBrowser://Downloads";
        /// <summary>
        /// 下载文件中包括@这种一般是病毒，不给下载
        /// </summary>
        public static readonly string CefDownLoadWarling = "这个文件是病毒,已放弃下载！";

        /// <summary>
        /// 是否在下载中， false是没有下载，True是有下载
        /// </summary>
        public static  bool IsDownloading = false;

        /// <summary>
        /// 强制中断下载
        /// </summary>
        public static  bool AbortDownloading = false;

        /// <summary>
        /// 主程序名称
        /// </summary>
        public static readonly string CefiBrowserName = "CefiBrowser.exe";

        public static float mouseNumber; //存放鼠标滚轮的值
        public static string DownloadsURL = "CefiBrowser://storage/downloads.html";
        public static string FileNotFoundURL = "CefiBrowser://storage/errors/notFound.html";
        public static string CannotConnectURL = "CefiBrowser://storage/errors/cannotConnect.html";
        public static string HomeUrl = @"baidu.com";

        public static string Branding = "CefiBrowser";
        public static string UserAgent = "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.113 Safari/537.36";
                                          

        //字符表 顺序为0..9,A..Z,a..z
        //OCR识别对照值
        public static readonly string[] CodeArray = new string[] {
"000111000011111110011000110110000011110000011110000011110000011110000011110000011110000011011000110011111110000111000",
"00111000111110001111100000011000000110000001100000011000000110000001100000011000000110001111111111111111",
"01111100111111101000001100000011000000110000011000001100000110000011000001100000110000001111111111111111",
"01111100111111111000001100000011000001100111110001111110000001110000001100000011100001111111111001111100",
"000001100000011100000011100000111100001101100001101100011001100011001100111111111111111111000001100000001100000001100",
"11111111111111111100000011000000110000001111100011111110000001110000001100000011100001111111111001111100",
"000111100001111110011000010011000000110000000110111100111111110111000111110000011110000011011000111011111110000111100",
"11111111111111110000001100000010000001100000110000001000000110000001000000110000001100000110000001100000",
"001111100011111110011000110011000110011100100001111100001111100011001110110000011110000011111000111011111110001111100",
"001111000011111110111000110110000011110000011111000111011111111001111011000000011000000110010000110011111100001111000",
"001100010010100001100001100001111111100001100001100001100001",//A
"111110100001100001100001111110100001100001100001100001111110",//B
"011110100001100000100000100000100000100000100000100001011110",//C
"111100100010100001100001100001100001100001100001100010111100",//D
"11111111111111111100000011000000110000001111111011111110110000001100000011000000110000001111111111111111",//E
"111111100000100000100000111110100000100000100000100000100000",//F
"011110100001100000100000100000100111100001100001100011011101",//G
"100001100001100001100001111111100001100001100001100001100001",//H
"11111001000010000100001000010000100001000010011111",//I
"000111000010000010000010000010000010000010100010100010011100",//J
"110000000110000000110000000110000110110001100110011000110110000111100000110110000110011000110001100110000110110000011",//K
"100000100000100000100000100000100000100000100000100000111111",//L
"1000001110001111000111010101101010110010011001001100000110000011000001",//M
"100001110001110001101001101001100101100101100011100011100001",//N
"011110100001100001100001100001100001100001100001100001011110",//O
"111110100001100001100001111110100000100000100000100000100000",//P
"01111001000010100001010000101000010100001010000101011010110011001111000000011",//Q
"1111110000111111100011000111001100001100110000110011000111001111111000111111000011001100001100011000110000110011000001101100000011",//R
"011110100001100001100000011000000110000001100001100001011110",//S
"1111111000100000010000001000000100000010000001000000100000010000001000",//T
"100001100001100001100001100001100001100001100001100001011110",//U
"1000001100000110000010100010010001001000100010100001010000010000001000",//V
"1000001100000110000011001001100100110010011001001101010110101010100010",//W
"100001100001010010010010001100001100010010010010100001100001",//X
"1000001100000101000100100010001010000010000001000000100000010000001000",//Y
"11111111111111110000001100000110000011000000110000011000001100000011000001100000110000001111111111111111",//Z
"011110100001000111011001100001100011011101",//a
"100000100000100000101110110001100001100001100001110001101110",//b
"011110100001100000100000100000100001011110",//c
"000001000001000001011101100011100001100001100001100011011101",//d
"011110100001100001111111100000100000011110",//e
"001110010001010000010000111110010000010000010000010000010000",//f
"000001011101100010100010100010011100010000011110100001100001011110",//g
"100000100000100000101110110001100001100001100001100001100001",//h
"00100001000000001100001000010000100001000010011111",//i
"00001000010000000011000010000100001000010000100001000011001001100",//j
"100000100000100000100010100100101000111000100100100010100001",//k
"01100001000010000100001000010000100001000010011111",//l
"1110110100100110010011001001100100110010011001001",//m
"101110110001100001100001100001100001100001",//n
"00111100011111101110011111000011110000111100001111000011111001110111111000111100",//o
"101110110001100001100001100001110001101110100000100000100000",//p
"011101100011100001100001100001100011011101000001000001000001",//q
"101110110001100000100000100000100000100000",//r
"011110100001100000011110000001100001011110",//s
"001000001000111110001000001000001000001000001000001001000110",//t
"11000011110000111100001111000011110000111100001111000011110001111111101101110011",//u
"100001100001100001010010010010001100001100",//v
"1000001100100110010011001001100100110101010100010",//w
"100001100001010010001100010010100001100001",//x
"100001100001100001100001100001010011001101000001000010011100",//y
"111111000010000100001000010000100000111111"//z

        };
        #endregion
    }
}
